//============================================================
//
//	バトル状態ヘッダー [battleState.h]
//	Author：藤田勇一
//
//============================================================
//************************************************************
//	二重インクルード防止
//************************************************************
#ifndef _BATTLE_STATE_H_
#define _BATTLE_STATE_H_

//************************************************************
//	前方宣言
//************************************************************
class CBattleManager;	// バトルマネージャークラス

//************************************************************
//	クラス定義
//************************************************************
// バトル状態クラス
class CBattleState
{
public:
	// コンストラクタ
	CBattleState();

	// デストラクタ
	virtual ~CBattleState();

	// 純粋仮想関数
	virtual HRESULT Init()	= 0;	// 初期化
	virtual void Uninit()	= 0;	// 終了
	virtual void Update(const float fDeltaTime) = 0;	// 更新

	// メンバ関数
	inline void SetContext(CBattleManager* pContext) { m_pContext = pContext; }	// コンテキスト設定

protected:
	// メンバ変数
	CBattleManager* m_pContext;	// コンテキスト
};

//************************************************************
//	インクルードファイル
//************************************************************
#include "battleStateNormal.h"

#endif	// _BATTLE_STATE_H_
