//============================================================
//
//	文字状態ヘッダー [charState.h]
//	Author：藤田勇一
//
//============================================================
//************************************************************
//	二重インクルード防止
//************************************************************
#ifndef _CHAR_STATE_H_
#define _CHAR_STATE_H_

//************************************************************
//	前方宣言
//************************************************************
class CStartStateCreateName;	// 命名状態クラス

//************************************************************
//	クラス定義
//************************************************************
// 文字状態クラス
class CCharState
{
public:
	// コンストラクタ
	CCharState();

	// デストラクタ
	virtual ~CCharState();

	// 純粋仮想関数
	virtual HRESULT Init(void)	= 0;	// 初期化
	virtual void Uninit(void)	= 0;	// 終了
	virtual void Update(const float fDeltaTime) = 0;	// 更新

	// 仮想関数
	virtual void SetContext(CStartStateCreateName *pContext) { m_pContext = pContext; }	// コンテキスト設定

protected:
	// メンバ変数
	CStartStateCreateName *m_pContext;	// コンテキスト
};

//************************************************************
//	インクルードファイル
//************************************************************
#include "charStateHiragana.h"

#endif	// _CHAR_STATE_H_
