//============================================================
//
//	アイテムテキスト保存バッファ処理 [frame2DTextBufferItem.cpp]
//	Author：藤田勇一
//
//============================================================
//************************************************************
//	インクルードファイル
//************************************************************
#include "frame2DTextBufferItem.h"
#include "frame2DTextStateItem.h"

//************************************************************
//	子クラス [CFrame2DTextBufferItem] のメンバ関数
//************************************************************
//============================================================
//	コンストラクタ
//============================================================
CFrame2DTextBufferItem::CFrame2DTextBufferItem()
{

}

//============================================================
//	デストラクタ
//============================================================
CFrame2DTextBufferItem::~CFrame2DTextBufferItem()
{

}

//============================================================
//	テキスト機能状態の生成処理
//============================================================
CFrame2DTextState* CFrame2DTextBufferItem::CreateState()
{
	// アイテムテキスト状態を生成し返す
	return new CFrame2DTextStateItem;
}
