//============================================================
//
//	吹き出し状態処理 [gameStateEncount.cpp]
//	Author：藤田勇一
//
//============================================================
//************************************************************
//	インクルードファイル
//************************************************************
#include "gameStateEncount.h"
#include "gameManager.h"
#include "sceneGame.h"
#include "player.h"
#include "playerState.h"

//************************************************************
//	定数宣言
//************************************************************
namespace
{
	const float BALLOON_DISP_TIME = 1.0f;	// 吹き出しを表示し続ける時間
}

//************************************************************
//	子クラス [CGameStateEncount] のメンバ関数
//************************************************************
//============================================================
//	コンストラクタ
//============================================================
CGameStateEncount::CGameStateEncount() :
	m_fCurTime	(0.0f)	// 現在の待機時間

{

}

//============================================================
//	デストラクタ
//============================================================
CGameStateEncount::~CGameStateEncount()
{

}

//============================================================
//	初期化処理
//============================================================
HRESULT CGameStateEncount::Init()
{
	// メンバ変数を初期化
	m_fCurTime = 0.0f;	// 現在の待機時間

	CPlayer* pPlayer = CSceneGame::GetPlayer();	// プレイヤー情報
	if (pPlayer != nullptr)
	{
		// プレイヤーをエンカウント状態にする
		pPlayer->ChangeState(new CPlayerStateEncount);
	}

	return S_OK;
}

//============================================================
//	終了処理
//============================================================
void CGameStateEncount::Uninit()
{
	// 自身の破棄
	delete this;
}

//============================================================
//	更新処理
//============================================================
void CGameStateEncount::Update(const float fDeltaTime)
{
	// 待機時刻を進める
	m_fCurTime += fDeltaTime;
	if (m_fCurTime >= BALLOON_DISP_TIME)
	{ // 待機終了した場合

		// 待機時間を初期化
		m_fCurTime = 0.0f;

		// TODO：ソウルちかちか状態へ遷移
#if 0
		// フェード状態にする
		m_pContext->ChangeState(new CGameStateFade);
#endif
	}
}
