//============================================================
//
//	通常状態処理 [gameStateNormal.cpp]
//	Author：藤田勇一
//
//============================================================
//************************************************************
//	インクルードファイル
//************************************************************
#include "gameStateNormal.h"
#include "gameManager.h"
#include "menuManager.h"
#include "sceneGame.h"
#include "pause.h"

//************************************************************
//	子クラス [CGameStateNormal] のメンバ関数
//************************************************************
//============================================================
//	コンストラクタ
//============================================================
CGameStateNormal::CGameStateNormal()
{

}

//============================================================
//	デストラクタ
//============================================================
CGameStateNormal::~CGameStateNormal()
{

}

//============================================================
//	初期化処理
//============================================================
HRESULT CGameStateNormal::Init()
{
	return S_OK;
}

//============================================================
//	終了処理
//============================================================
void CGameStateNormal::Uninit()
{
	// 自身の破棄
	delete this;
}

//============================================================
//	更新処理
//============================================================
void CGameStateNormal::Update(const float fDeltaTime)
{
	// メニューマネージャーの更新
	CMenuManager::GetInstance()->Update(fDeltaTime);

	// ポーズの更新
	CPause* pPause = CSceneGame::GetPause();
	assert(pPause != nullptr);
	pPause->Update(fDeltaTime);
}
