//============================================================
//
//	待機状態ヘッダー [introStateWait.h]
//	Author：藤田勇一
//
//============================================================
//************************************************************
//	二重インクルード防止
//************************************************************
#ifndef _INTRO_STATE_WAIT_H_
#define _INTRO_STATE_WAIT_H_

//************************************************************
//	インクルードファイル
//************************************************************
#include "introState.h"

//************************************************************
//	前方宣言
//************************************************************
class CIntroManager;	// イントロマネージャークラス

//************************************************************
//	クラス定義
//************************************************************
// 待機状態クラス
class CIntroStateWait : public CIntroState
{
public:
	// コンストラクタ
	CIntroStateWait(CIntroManager *pIntro) :
		CIntroState(pIntro)	// イニシャライザ
	{}

	// デストラクタ
	~CIntroStateWait() override {}

	// オーバーライド関数
	HRESULT Init(void) override;	// 初期化
	void Uninit(void) override;		// 終了
	void Update(const float fDeltaTime) override;	// 更新
};

#endif	// _INTRO_STATE_WAIT_H_
