//============================================================
//
//	ロゴ表示状態ヘッダー [introStateLogo.h]
//	Author：藤田勇一
//
//============================================================
//************************************************************
//	二重インクルード防止
//************************************************************
#ifndef _INTRO_STATE_LOGO_H_
#define _INTRO_STATE_LOGO_H_

//************************************************************
//	インクルードファイル
//************************************************************
#include "introState.h"

//************************************************************
//	前方宣言
//************************************************************
class CIntroManager;	// イントロマネージャークラス
class CObject2D;		// オブジェクト2Dクラス

//************************************************************
//	クラス定義
//************************************************************
// ロゴ表示状態クラス
class CIntroStateLogo : public CIntroState
{
public:
	// コンストラクタ
	CIntroStateLogo();

	// デストラクタ
	~CIntroStateLogo() override;

	// オーバーライド関数
	HRESULT Init(void) override;	// 初期化
	void Uninit(void) override;		// 終了
	void Update(const float fDeltaTime) override;	// 更新

private:
	// メンバ変数
	CObject2D *m_pLogo;	// タイトルロゴ
	float m_fCurTime;	// 現在の待機時間
};

#endif	// _INTRO_STATE_LOGO_H_
