//============================================================
//
//	文字送り状態ヘッダー [introStateText.h]
//	Author：藤田勇一
//
//============================================================
//************************************************************
//	二重インクルード防止
//************************************************************
#ifndef _INTRO_STATE_TEXT_H_
#define _INTRO_STATE_TEXT_H_

//************************************************************
//	インクルードファイル
//************************************************************
#include "introState.h"

//************************************************************
//	クラス定義
//************************************************************
// 文字送り状態クラス
class CIntroStateText : public CIntroState
{
public:
	// コンストラクタ
	CIntroStateText();

	// デストラクタ
	~CIntroStateText() override;

	// オーバーライド関数
	HRESULT Init(void) override;	// 初期化
	void Uninit(void) override;		// 終了
	void Update(const float fDeltaTime) override;	// 更新
};

#endif	// _INTRO_STATE_TEXT_H_
