//============================================================
//
//	物語スクロール状態ヘッダー [introStateScroll.h]
//	Author：藤田勇一
//
//============================================================
//************************************************************
//	二重インクルード防止
//************************************************************
#ifndef _INTRO_STATE_SCROLL_H_
#define _INTRO_STATE_SCROLL_H_

//************************************************************
//	インクルードファイル
//************************************************************
#include "introState.h"

//************************************************************
//	クラス定義
//************************************************************
// 物語スクロール状態クラス
class CIntroStateScroll : public CIntroState
{
public:
	// コンストラクタ
	CIntroStateScroll();

	// デストラクタ
	~CIntroStateScroll() override;

	// オーバーライド関数
	HRESULT Init() override;	// 初期化
	void Uninit() override;		// 終了
	void Update(const float fDeltaTime) override;	// 更新
};

#endif	// _INTRO_STATE_SCROLL_H_
