//============================================================
//
//	文字送り速度低下状態処理 [introStateTextSlow.cpp]
//	Author：藤田勇一
//
//============================================================
//************************************************************
//	インクルードファイル
//************************************************************
#include "introStateTextSlow.h"
#include "introManager.h"

//************************************************************
//	定数宣言
//************************************************************
namespace
{

}

//************************************************************
//	子クラス [CIntroStateTextSlow] のメンバ関数
//************************************************************
//============================================================
//	コンストラクタ
//============================================================
CIntroStateTextSlow::CIntroStateTextSlow()
{

}

//============================================================
//	デストラクタ
//============================================================
CIntroStateTextSlow::~CIntroStateTextSlow()
{

}

//============================================================
//	初期化処理
//============================================================
HRESULT CIntroStateTextSlow::Init(void)
{
	// 親クラスの初期化
	if (FAILED(CIntroStateText::Init()))
	{ // 初期化に失敗した場合

		// 失敗を返す
		assert(false);
		return E_FAIL;
	}

	// 成功を返す
	return S_OK;
}

//============================================================
//	終了処理
//============================================================
void CIntroStateTextSlow::Uninit(void)
{
	// 文字送りの速度を通常に戻す
	m_pContext->SetEnableSlowText(false);

	// 親クラスの終了
	CIntroStateText::Uninit();
}

//============================================================
//	更新処理
//============================================================
void CIntroStateTextSlow::Update(const float fDeltaTime)
{
	if (m_pContext->GetNextCharID() == 20)
	{ // …の表示タイミングになった場合

		// 文字送りの速度を遅くする
		m_pContext->SetEnableSlowText(true);
	}

	// 親クラスの更新
	CIntroStateText::Update(fDeltaTime);
}
