//============================================================
//
//	物語スクロール状態処理 [introStateScroll.cpp]
//	Author：藤田勇一
//
//============================================================
//************************************************************
//	インクルードファイル
//************************************************************
#include "introStateScroll.h"
#include "introManager.h"

//************************************************************
//	子クラス [CIntroStateScroll] のメンバ関数
//************************************************************
//============================================================
//	コンストラクタ
//============================================================
CIntroStateScroll::CIntroStateScroll()
{

}

//============================================================
//	デストラクタ
//============================================================
CIntroStateScroll::~CIntroStateScroll()
{

}

//============================================================
//	初期化処理
//============================================================
HRESULT CIntroStateScroll::Init()
{
	// 物語のスクロールを開始する
	m_pContext->StartScrollStory();

	return S_OK;
}

//============================================================
//	終了処理
//============================================================
void CIntroStateScroll::Uninit()
{
	// 自身の破棄
	delete this;
}

//============================================================
//	更新処理
//============================================================
void CIntroStateScroll::Update(const float fDeltaTime)
{
	if (m_pContext->NormalizeScrollStory())
	{ // テクスチャがワンループした場合

		// 終了状態にする
		m_pContext->ChangeState(new CIntroStateEnd);
	}
}
