//============================================================
//
//	イントロマネージャーヘッダー [introManager.h]
//	Author：藤田勇一
//
//============================================================
//************************************************************
//	二重インクルード防止
//************************************************************
#ifndef _INTROMANAGER_H_
#define _INTROMANAGER_H_

//************************************************************
//	前方宣言
//************************************************************
class CObject2D;	// オブジェクト2Dクラス

//************************************************************
//	クラス定義
//************************************************************
// イントロマネージャークラス
class CIntroManager
{
public:
	// コンストラクタ
	CIntroManager();

	// デストラクタ
	~CIntroManager();

	// メンバ関数
	HRESULT Init(void);	// 初期化
	void Uninit(void);	// 終了
	void Update(const float fDeltaTime);	// 更新

	// 静的メンバ関数
	static CIntroManager *Create(void);	// 生成
	static void Release(CIntroManager *&prIntroManager);	// 破棄
};

#endif	// _INTROMANAGER_H_
