//============================================================
//
//	フェード状態ヘッダー [introStateFade.h]
//	Author：藤田勇一
//
//============================================================
//************************************************************
//	二重インクルード防止
//************************************************************
#ifndef _INTRO_STATE_FADE_H_
#define _INTRO_STATE_FADE_H_

//************************************************************
//	インクルードファイル
//************************************************************
#include "introState.h"

//************************************************************
//	クラス定義
//************************************************************
// フェード状態クラス
class CIntroStateFade : public CIntroState
{
public:
	// コンストラクタ
	CIntroStateFade();

	// デストラクタ
	~CIntroStateFade() override;

	// オーバーライド関数
	HRESULT Init() override;	// 初期化
	void Uninit() override;		// 終了
	void Update(const float fDeltaTime) override;	// 更新
};

#endif	// _INTRO_STATE_FADE_H_
