//============================================================
//
//	物語スクロール状態処理 [introStateScroll.cpp]
//	Author：藤田勇一
//
//============================================================
//************************************************************
//	インクルードファイル
//************************************************************
#include "introStateScroll.h"
#include "introManager.h"

//************************************************************
//	定数宣言
//************************************************************
namespace
{
	const float WAIT_TIME = 4.0f;	// 物語スクロール待機時間
}

//************************************************************
//	子クラス [CIntroStateScroll] のメンバ関数
//************************************************************
//============================================================
//	コンストラクタ
//============================================================
CIntroStateScroll::CIntroStateScroll() :
	m_fCurTime	(0.0f)	// 現在の待機時間
{

}

//============================================================
//	デストラクタ
//============================================================
CIntroStateScroll::~CIntroStateScroll()
{

}

//============================================================
//	初期化処理
//============================================================
HRESULT CIntroStateScroll::Init(void)
{
	// メンバ変数を初期化
	m_fCurTime = 0.0f;	// 現在の待機時間

	// 成功を返す
	return S_OK;
}

//============================================================
//	終了処理
//============================================================
void CIntroStateScroll::Uninit(void)
{
	// 自身の破棄
	delete this;
}

//============================================================
//	更新処理
//============================================================
void CIntroStateScroll::Update(const float fDeltaTime)
{
	if (m_pContext->NormalizeScrollStory())
	{ // テクスチャがワンループした場合

		// 終了状態にする
		m_pContext->ChangeState(new CIntroStateEnd);
	}
}

//============================================================
//	コンテキスト設定処理
//============================================================
void CIntroStateScroll::SetContext(CIntroManager *pContext)
{
	// コンテキストを設定
	CIntroState::SetContext(pContext);

	// 物語のスクロールを開始する
	m_pContext->StartScrollStory();
}
