//============================================================
//
//	特殊効果なしアイテムヘッダー [itemNone.h]
//	Author：藤田勇一
//
//============================================================
//************************************************************
//	二重インクルード防止
//************************************************************
#ifndef _ITEM_NONE_H_
#define _ITEM_NONE_H_

//************************************************************
//	インクルードファイル
//************************************************************
#include "item.h"

//************************************************************
//	クラス定義
//************************************************************
// 特殊効果なしアイテム情報クラス
class CItemNone : public CItemData
{
public:
	// コンストラクタ
	CItemNone();

	// デストラクタ
	~CItemNone() override;

	// オーバーライド関数
	HRESULT Init(void) override;	// 初期化
	void Uninit(void) override;		// 終了
	void Use(void) override;		// アイテム使用
	void Info(void) override;		// アイテム情報
	void Drop(void) override;		// アイテム破棄

private:
	// メンバ変数

};

#endif	// _ITEM_NONE_H_
