//============================================================
//
//	テキスト読込関数ヘッダー [loadtext.h]
//	Author：藤田勇一
//
//============================================================
//************************************************************
//	二重インクルード防止
//************************************************************
#ifndef _LOAD_TEXT_H_
#define _LOAD_TEXT_H_

//************************************************************
//	前方宣言
//************************************************************
class CText2D;	// テキスト2Dクラス 

//************************************************************
//	名前空間宣言
//************************************************************
// テキスト読込空間
namespace loadtext
{
	std::vector<std::wstring> LoadText(const char *pFilePass, const int nTextID);	// テキスト読込
	void BindText(CText2D *pText2D, const std::vector<std::wstring> &rVecStr);		// テキスト割当
}

#endif	// _LOAD_TEXT_H_
