//============================================================
//
//	ステータスメニュー処理 [menuStatusUI.cpp]
//	Author：藤田勇一
//
//============================================================
//************************************************************
//	インクルードファイル
//************************************************************
#include "menuStatusUI.h"
#include "frame2D.h"
#include "string2D.h"
#include "text2D.h"

//************************************************************
//	定数宣言
//************************************************************
namespace
{
	const int PRIORITY = 0;	// ステータスメニューの優先順位

	namespace frame
	{
		const D3DXVECTOR3 POS	= D3DXVECTOR3(155.0f, 160.0f, 0.0f);	// フレーム位置
		const D3DXVECTOR3 ROT	= VEC3_ZERO;							// フレーム向き
		const D3DXVECTOR3 SIZE	= D3DXVECTOR3(200.0f, 140.0f, 0.0f);	// フレーム大きさ
	}
}

//************************************************************
//	子クラス [CMenuStatusUI] のメンバ関数
//************************************************************
//============================================================
//	コンストラクタ
//============================================================
CMenuStatusUI::CMenuStatusUI() : CObject(CObject::LABEL_UI, CObject::DIM_3D, PRIORITY),
	m_pFrame	(nullptr),	// フレーム情報
	m_pName		(nullptr),	// 名前情報
	m_pStatus	(nullptr)	// ステータス情報
{

}

//============================================================
//	デストラクタ
//============================================================
CMenuStatusUI::~CMenuStatusUI()
{

}

//============================================================
//	初期化処理
//============================================================
HRESULT CMenuStatusUI::Init(void)
{
	// メンバ変数を初期化
	m_pFrame	= nullptr;	// フレーム情報
	m_pName		= nullptr;	// 名前情報
	m_pStatus	= nullptr;	// ステータス情報

	// フレームの生成
	m_pFrame = CFrame2D::Create
	( // 引数
		frame::POS,	// 位置
		frame::ROT,	// 向き
		frame::SIZE	// 大きさ
	);
	if (m_pFrame == nullptr)
	{ // 生成に失敗した場合

		// 失敗を返す
		assert(false);
		return E_FAIL;
	}

	// 成功を返す
	return S_OK;
}

//============================================================
//	終了処理
//============================================================
void CMenuStatusUI::Uninit(void)
{
	// オブジェクトを破棄
	Release();
}

//============================================================
//	更新処理
//============================================================
void CMenuStatusUI::Update(const float fDeltaTime)
{

}

//============================================================
//	描画処理
//============================================================
void CMenuStatusUI::Draw(CShader * /*pShader*/)
{

}

//============================================================
//	生成処理
//============================================================
CMenuStatusUI *CMenuStatusUI::Create(void)
{
	// ステータスメニューの生成
	CMenuStatusUI *pMenuStatusUI = new CMenuStatusUI;
	if (pMenuStatusUI == nullptr)
	{ // 生成に失敗した場合

		return nullptr;
	}
	else
	{ // 生成に成功した場合

		// ステータスメニューの初期化
		if (FAILED(pMenuStatusUI->Init()))
		{ // 初期化に失敗した場合

			// ステータスメニューの破棄
			SAFE_DELETE(pMenuStatusUI);
			return nullptr;
		}

		// 確保したアドレスを返す
		return pMenuStatusUI;
	}
}
