//============================================================
//
//	フィールドメニューヘッダー [menuUI.h]
//	Author：藤田勇一
//
//============================================================
//************************************************************
//	二重インクルード防止
//************************************************************
#ifndef _MENU_UI_H_
#define _MENU_UI_H_

//************************************************************
//	インクルードファイル
//************************************************************
#include "object.h"

//************************************************************
//	前方宣言
//************************************************************
class CMenuStatusUI;	// ステータスメニュークラス

//************************************************************
//	クラス定義
//************************************************************
// フィールドメニュークラス
class CMenuUI : public CObject
{
public:
	// コンストラクタ
	CMenuUI();

	// デストラクタ
	~CMenuUI() override;

	// オーバーライド関数
	HRESULT Init(void) override;	// 初期化
	void Uninit(void) override;		// 終了
	void Update(const float fDeltaTime) override;	// 更新
	void Draw(CShader *pShader = nullptr) override;	// 描画

	// 静的メンバ関数
	static CMenuUI *Create(void);	// 生成

private:
	// オーバーライド関数
	void Release(void) override { CObject::Release(); }	// 破棄

	// メンバ変数
	CMenuStatusUI *m_pStatusMenu;	// ステータスメニュー情報
};

#endif	// _MENU_UI_H_
