//============================================================
//
//	フィールドメニュー処理 [menuUI.cpp]
//	Author：藤田勇一
//
//============================================================
//************************************************************
//	インクルードファイル
//************************************************************
#include "menuUI.h"
#include "menuStatusUI.h"

//************************************************************
//	定数宣言
//************************************************************
namespace
{
	const int PRIORITY = 0;	// フィールドメニューの優先順位
}

//************************************************************
//	子クラス [CMenuUI] のメンバ関数
//************************************************************
//============================================================
//	コンストラクタ
//============================================================
CMenuUI::CMenuUI() : CObject(CObject::LABEL_UI, CObject::DIM_3D, PRIORITY),
	m_pStatusMenu	(nullptr),	// ステータスメニュー情報
	m_pSelectMenu	(nullptr)	// セレクトメニュー情報
{

}

//============================================================
//	デストラクタ
//============================================================
CMenuUI::~CMenuUI()
{

}

//============================================================
//	初期化処理
//============================================================
HRESULT CMenuUI::Init(void)
{
	// メンバ変数を初期化
	m_pStatusMenu = nullptr;	// ステータスメニュー情報
	m_pSelectMenu = nullptr;	// セレクトメニュー情報

	// ステータスメニューの生成
	m_pStatusMenu = CMenuStatusUI::Create();
	if (m_pStatusMenu == nullptr)
	{ // 生成に失敗した場合

		// 失敗を返す
		assert(false);
		return E_FAIL;
	}

	// セレクトメニューの生成
	m_pSelectMenu = CMenuSelectUI::Create();
	if (m_pSelectMenu == nullptr)
	{ // 生成に失敗した場合

		// 失敗を返す
		assert(false);
		return E_FAIL;
	}

	// 成功を返す
	return S_OK;
}

//============================================================
//	終了処理
//============================================================
void CMenuUI::Uninit(void)
{
	// ステータスメニューの終了
	SAFE_UNINIT(m_pStatusMenu);

	// セレクトメニューの終了
	SAFE_UNINIT(m_pSelectMenu);

	// オブジェクトを破棄
	Release();
}

//============================================================
//	更新処理
//============================================================
void CMenuUI::Update(const float fDeltaTime)
{

}

//============================================================
//	描画処理
//============================================================
void CMenuUI::Draw(CShader * /*pShader*/)
{

}

//============================================================
//	生成処理
//============================================================
CMenuUI *CMenuUI::Create(void)
{
	// フィールドメニューの生成
	CMenuUI *pMenuUI = new CMenuUI;
	if (pMenuUI == nullptr)
	{ // 生成に失敗した場合

		return nullptr;
	}
	else
	{ // 生成に成功した場合

		// フィールドメニューの初期化
		if (FAILED(pMenuUI->Init()))
		{ // 初期化に失敗した場合

			// フィールドメニューの破棄
			SAFE_DELETE(pMenuUI);
			return nullptr;
		}

		// 確保したアドレスを返す
		return pMenuUI;
	}
}
