//============================================================
//
//	プレイヤーアイテムヘッダー [playerItem.h]
//	Author：藤田勇一
//
//============================================================
//************************************************************
//	二重インクルード防止
//************************************************************
#ifndef _PLAYER_ITEM_H_
#define _PLAYER_ITEM_H_

//************************************************************
//	構造体定義
//************************************************************
// プレイヤーアイテム構造体
struct SPlayerItem
{
public:
	// 定数
	static constexpr int MAX_ITEM = 8;	// 最大アイテム数

	// デフォルトコンストラクタ
	SPlayerItem() { memset(nItemIdx, 0, sizeof(nItemIdx)); }

	// デストラクタ
	~SPlayerItem() {}

	// メンバ変数
	int nItemIdx[MAX_ITEM];	// アイテムインデックス
};

#endif	// _PLAYER_ITEM_H_
