//============================================================
//
//	なにもしない状態ヘッダー [playerStateNone.h]
//	Author：藤田勇一
//
//============================================================
//************************************************************
//	二重インクルード防止
//************************************************************
#ifndef _PLAYER_STATE_NONE_H_
#define _PLAYER_STATE_NONE_H_

//************************************************************
//	インクルードファイル
//************************************************************
#include "playerState.h"
#include "player.h"

//************************************************************
//	クラス定義
//************************************************************
// なにもしない状態クラス
class CPlayerStateNone : public CPlayerState
{
public:
	// コンストラクタ
	CPlayerStateNone();

	// デストラクタ
	~CPlayerStateNone() override;

	// オーバーライド関数
	HRESULT Init() override;	// 初期化
	void Uninit() override;		// 終了
	int Update(const float fDeltaTime) override;	// 更新
};

#endif	// _PLAYER_STATE_NONE_H_
