//============================================================
//
//	プレイヤー状態ヘッダー [playerState.h]
//	Author：藤田勇一
//
//============================================================
//************************************************************
//	二重インクルード防止
//************************************************************
#ifndef _PLAYER_STATE_H_
#define _PLAYER_STATE_H_

//************************************************************
//	前方宣言
//************************************************************
class CPlayer;	// プレイヤークラス

//************************************************************
//	クラス定義
//************************************************************
// プレイヤー状態クラス
class CPlayerState
{
public:
	// コンストラクタ
	CPlayerState();

	// デストラクタ
	virtual ~CPlayerState();

	// 純粋仮想関数
	virtual HRESULT Init(void)	= 0;	// 初期化
	virtual void Uninit(void)	= 0;	// 終了
	virtual int Update(const float fDeltaTime) = 0;	// 更新

	// メンバ関数
	void SetContext(CPlayer *pContext) { m_pContext = pContext; }	// コンテキスト設定

protected:
	// メンバ変数
	CPlayer *m_pContext;	// コンテキスト
};

//************************************************************
//	インクルードファイル
//************************************************************
#include "playerStateNormal.h"

#endif	// _PLAYER_STATE_H_
