//============================================================
//
//	プレイヤー所持アイテム処理 [playerItem.cpp]
//	Author：藤田勇一
//
//============================================================
//************************************************************
//	インクルードファイル
//************************************************************
#include "playerItem.h"

//************************************************************
//	定数宣言
//************************************************************
namespace
{

}

//************************************************************
//	親クラス [CPlayerStatus] のメンバ関数
//************************************************************
//============================================================
//	コンストラクタ
//============================================================
CPlayerItem::CPlayerItem() :
	m_vecItemIdx({})	// アイテムインデックス
{

}

//============================================================
//	デストラクタ
//============================================================
CPlayerItem::~CPlayerItem()
{

}
 
//============================================================
//	アイテムの追加処理
//============================================================
void CPlayerItem::PushBackItem(const int nItemIdx)
{
	// アイテム枠が空いていない場合抜ける
	if (GetNumItem() >= CPlayerItem::MAX_ITEM) { return; }

	// 最後尾に引数のアイテムインデックスを追加
	m_vecItemIdx.push_back(nItemIdx);
}

//============================================================
//	アイテムの削除処理
//============================================================
void CPlayerItem::DeleteItem(const int nBagIdx)
{
	// 所持アイテム数の範囲外インデックスなら抜ける
	if (GetNumItem() <= nBagIdx) { return; }

	// 引数バッグインデックスのアイテムを削除
	m_vecItemIdx.erase(m_vecItemIdx.begin() + nBagIdx);
}

//============================================================
//	アイテムインデックスの取得処理
//============================================================
int CPlayerItem::GetItemIdx(const int nBagIdx)
{
	// 所持アイテム数の範囲外インデックスなら抜ける
	if (GetNumItem() <= nBagIdx) { return NONE_IDX; }

	// 引数バッグインデックスのアイテムを返す
	return m_vecItemIdx[nBagIdx];
}

//============================================================
//	アイテムインデックスの設定処理
//============================================================
void CPlayerItem::SetItemIdx(const int nBagIdx, const int nItemIdx)
{
	// 所持アイテム数の範囲外インデックスなら抜ける
	if (GetNumItem() <= nBagIdx) { return; }

	// 引数バッグインデックスのアイテムを変更
	m_vecItemIdx[nBagIdx] = nItemIdx;
}
