//============================================================
//
//	データ保存ヘッダー [retention.h]
//	Author：藤田勇一
//
//============================================================
//************************************************************
//	二重インクルード防止
//************************************************************
#ifndef _RETENTION_H_
#define _RETENTION_H_

//************************************************************
//	クラス定義
//************************************************************
// データ保存クラス
class CRetention
{
public:
	// コンストラクタ
	CRetention();

	// デストラクタ
	~CRetention();

	// メンバ関数
	HRESULT Init(void);	// 初期化
	void Uninit(void);	// 終了

	// 静的メンバ関数
	static CRetention *Create(void);	// 生成
	static void Release(CRetention *&prRetention);	// 破棄
};

#endif	// _RETENTION_H_
