//============================================================
//
//	データ保存マネージャー処理 [retentionManager.cpp]
//	Author：藤田勇一
//
//============================================================
//************************************************************
//	インクルードファイル
//************************************************************
#include "retentionManager.h"

//************************************************************
//	親クラス [CRetentionManager] のメンバ関数
//************************************************************
//============================================================
//	コンストラクタ
//============================================================
CRetentionManager::CRetentionManager()
{

}

//============================================================
//	デストラクタ
//============================================================
CRetentionManager::~CRetentionManager()
{

}

//============================================================
//	初期化処理
//============================================================
HRESULT CRetentionManager::Init(void)
{
	// 成功を返す
	return S_OK;
}

//============================================================
//	終了処理
//============================================================
void CRetentionManager::Uninit(void)
{

}

//============================================================
//	生成処理
//============================================================
CRetentionManager *CRetentionManager::Create(void)
{
	// データ保存マネージャーの生成
	CRetentionManager *pRetentionManager = new CRetentionManager;
	if (pRetentionManager == nullptr)
	{ // 生成に失敗した場合

		return nullptr;
	}
	else
	{ // 生成に成功した場合

		// データ保存マネージャーの初期化
		if (FAILED(pRetentionManager->Init()))
		{ // 初期化に失敗した場合

			// データ保存マネージャーの破棄
			SAFE_DELETE(pRetentionManager);
			return nullptr;
		}

		// 確保したアドレスを返す
		return pRetentionManager;
	}
}

//============================================================
//	破棄処理
//============================================================
void CRetentionManager::Release(CRetentionManager *&prRetentionManager)
{
	// データ保存マネージャーの終了
	assert(prRetentionManager != nullptr);
	prRetentionManager->Uninit();

	// メモリ開放
	SAFE_DELETE(prRetentionManager);
}
