//============================================================
//
//	データ保存処理 [retention.cpp]
//	Author：藤田勇一
//
//============================================================
//************************************************************
//	インクルードファイル
//************************************************************
#include "retention.h"

//************************************************************
//	親クラス [CRetention] のメンバ関数
//************************************************************
//============================================================
//	コンストラクタ
//============================================================
CRetention::CRetention()
{

}

//============================================================
//	デストラクタ
//============================================================
CRetention::~CRetention()
{

}

//============================================================
//	初期化処理
//============================================================
HRESULT CRetention::Init(void)
{
	// 成功を返す
	return S_OK;
}

//============================================================
//	終了処理
//============================================================
void CRetention::Uninit(void)
{

}

//============================================================
//	生成処理
//============================================================
CRetention *CRetention::Create(void)
{
	// データ保存の生成
	CRetention *pRetention = new CRetention;
	if (pRetention == nullptr)
	{ // 生成に失敗した場合

		return nullptr;
	}
	else
	{ // 生成に成功した場合

		// データ保存の初期化
		if (FAILED(pRetention->Init()))
		{ // 初期化に失敗した場合

			// データ保存の破棄
			SAFE_DELETE(pRetention);
			return nullptr;
		}

		// 確保したアドレスを返す
		return pRetention;
	}
}

//============================================================
//	破棄処理
//============================================================
void CRetention::Release(CRetention*& prRetention)
{
	// データ保存の終了
	assert(prRetention != nullptr);
	prRetention->Uninit();

	// メモリ開放
	SAFE_DELETE(prRetention);
}
