//============================================================
//
//	イントロ画面ヘッダー [sceneIntro.h]
//	Author：藤田勇一
//
//============================================================
//************************************************************
//	二重インクルード防止
//************************************************************
#ifndef _SCENE_INTRO_H_
#define _SCENE_INTRO_H_

//************************************************************
//	インクルードファイル
//************************************************************
#include "scene.h"

//************************************************************
//	前方宣言
//************************************************************
class CIntroManager;	// イントロマネージャークラス

//************************************************************
//	クラス定義
//************************************************************
// イントロ画面クラス
class CSceneIntro : public CScene
{
public:
	// コンストラクタ
	explicit CSceneIntro(const EMode mode);

	// デストラクタ
	~CSceneIntro() override;

	// オーバーライド関数
	HRESULT Init(void) override;	// 初期化
	void Uninit(void) override;		// 終了
	void Update(const float fDeltaTime) override;	// 更新

	// 静的メンバ関数
	static CIntroManager *GetIntroManager(void);	// イントロマネージャー取得

private:
	// 静的メンバ変数
	static CIntroManager *m_pIntroManager;	// イントロマネージャー
};

#endif	// _SCENE_INTRO_H_
