//============================================================
//
//	バトル画面ヘッダー [sceneBattle.h]
//	Author：藤田勇一
//
//============================================================
//************************************************************
//	二重インクルード防止
//************************************************************
#ifndef _SCENE_BATTLE_H_
#define _SCENE_BATTLE_H_

//************************************************************
//	インクルードファイル
//************************************************************
#include "scene.h"

//************************************************************
//	前方宣言
//************************************************************
class CBattleManager;	// バトルマネージャークラス

//************************************************************
//	クラス定義
//************************************************************
// バトル画面クラス
class CSceneBattle : public CScene
{
public:
	// コンストラクタ
	explicit CSceneBattle(const EMode mode);

	// デストラクタ
	~CSceneBattle() override;

	// オーバーライド関数
	HRESULT Init() override;	// 初期化
	void Uninit() override;		// 終了
	void Update(const float fDeltaTime) override;	// 更新

	// 静的メンバ関数
	static CBattleManager* GetBattleManager();	// バトルマネージャー取得

private:
	// 静的メンバ変数
	static CBattleManager* m_pBattleManager;	// バトルマネージャー
};

#endif	// _SCENE_BATTLE_H_
