//============================================================
//
//	スタート画面ヘッダー [sceneStart.h]
//	Author：藤田勇一
//
//============================================================
//************************************************************
//	二重インクルード防止
//************************************************************
#ifndef _SCENE_START_H_
#define _SCENE_START_H_

//************************************************************
//	インクルードファイル
//************************************************************
#include "scene.h"

//************************************************************
//	前方宣言
//************************************************************
class CStartManager;	// スタートマネージャークラス

//************************************************************
//	クラス定義
//************************************************************
// スタート画面クラス
class CSceneStart : public CScene
{
public:
	// コンストラクタ
	explicit CSceneStart(const EMode mode);

	// デストラクタ
	~CSceneStart() override;

	// オーバーライド関数
	HRESULT Init() override;	// 初期化
	void Uninit() override;		// 終了
	void Update(const float fDeltaTime) override;	// 更新

	// 静的メンバ関数
	static CStartManager* GetStartManager();	// スタートマネージャー取得

private:
	// 静的メンバ変数
	static CStartManager* m_pStartManager;	// スタートマネージャー
};

#endif	// _SCENE_START_H_
