//============================================================
//
//	スタート画面処理 [sceneStart.cpp]
//	Author：藤田勇一
//
//============================================================
//************************************************************
//	インクルードファイル
//************************************************************
#include "sceneStart.h"
#include "manager.h"
#include "texture.h"
#include "sound.h"
#include "camera.h"
#include "startManager.h"

//************************************************************
//	静的メンバ変数宣言
//************************************************************
CStartManager *CSceneStart::m_pStartManager = nullptr;	// スタートマネージャー

//************************************************************
//	子クラス [CSceneStart] のメンバ関数
//************************************************************
//============================================================
//	コンストラクタ
//============================================================
CSceneStart::CSceneStart(const EMode mode) : CScene(mode)
{

}

//============================================================
//	デストラクタ
//============================================================
CSceneStart::~CSceneStart()
{

}

//============================================================
//	初期化処理
//============================================================
HRESULT CSceneStart::Init(void)
{
	//--------------------------------------------------------
	//	スタートの初期化
	//--------------------------------------------------------
	// スタートマネージャーの生成
	m_pStartManager = CStartManager::Create();
	if (m_pStartManager == nullptr)
	{ // 非使用中の場合

		// 失敗を返す
		assert(false);
		return E_FAIL;
	}

	// シーンの初期化
	CScene::Init();

	// 成功を返す
	return S_OK;
}

//============================================================
//	終了処理
//============================================================
void CSceneStart::Uninit(void)
{
	// スタートマネージャーの破棄
	SAFE_REF_RELEASE(m_pStartManager);

	// シーンの終了
	CScene::Uninit();
}

//============================================================
//	更新処理
//============================================================
void CSceneStart::Update(const float fDeltaTime)
{
	// スタートマネージャーの更新
	assert(m_pStartManager != nullptr);
	m_pStartManager->Update(fDeltaTime);

	// シーンの更新
	CScene::Update(fDeltaTime);
}

//============================================================
//	スタートマネージャー取得処理
//============================================================
CStartManager *CSceneStart::GetStartManager(void)
{
	// インスタンス未使用
	assert(m_pStartManager != nullptr);

	// スタートマネージャーを返す
	return m_pStartManager;
}
