//============================================================
//
//	電話メニュー処理 [selectPhoneUI.cpp]
//	Author：藤田勇一
//
//============================================================
//************************************************************
//	インクルードファイル
//************************************************************
#include "selectPhoneUI.h"

//************************************************************
//	定数宣言
//************************************************************
namespace
{
	const int PRIORITY = 6;	// 電話メニューの優先順位

	namespace frame
	{
		const D3DXVECTOR3 POS	= D3DXVECTOR3(560.0f, 362.5f, 0.0f);	// フレーム位置
		const D3DXVECTOR3 ROT	= VEC3_ZERO;							// フレーム向き
		const D3DXVECTOR3 SIZE	= D3DXVECTOR3(380.0f, 450.0f, 0.0f);	// フレーム大きさ
	}
}

//************************************************************
//	子クラス [CSelectPhoneUI] のメンバ関数
//************************************************************
//============================================================
//	コンストラクタ
//============================================================
CSelectPhoneUI::CSelectPhoneUI(AFuncUninit funcUninit, CObject2D *pSoul) : CSelectUI(funcUninit, pSoul)
{

}

//============================================================
//	デストラクタ
//============================================================
CSelectPhoneUI::~CSelectPhoneUI()
{

}

//============================================================
//	初期化処理
//============================================================
HRESULT CSelectPhoneUI::Init(void)
{
	// セレクトUIの初期化
	if (FAILED(CSelectUI::Init()))
	{ // 初期化に失敗した場合

		// 失敗を返す
		assert(false);
		return E_FAIL;
	}

	// フレームの位置を設定
	SetFramePosition(frame::POS);

	// フレームの向きを設定
	SetFrameRotation(frame::ROT);

	// フレームの大きさを設定
	SetFrameSizing(frame::SIZE);

	// 成功を返す
	return S_OK;
}

//============================================================
//	終了処理
//============================================================
void CSelectPhoneUI::Uninit(void)
{
	// セレクトUIの終了
	CSelectUI::Uninit();
}

//============================================================
//	更新処理
//============================================================
void CSelectPhoneUI::Update(const float fDeltaTime)
{
	// セレクトUIの更新
	CSelectUI::Update(fDeltaTime);
}

//============================================================
//	描画処理
//============================================================
void CSelectPhoneUI::Draw(CShader *pShader)
{
	// セレクトUIの描画
	CSelectUI::Draw(pShader);
}
