//============================================================
//
//	チュートリアル状態ヘッダー [startStateTutorial.h]
//	Author：藤田勇一
//
//============================================================
//************************************************************
//	二重インクルード防止
//************************************************************
#ifndef _START_STATE_TUTORIAL_H_
#define _START_STATE_TUTORIAL_H_

//************************************************************
//	インクルードファイル
//************************************************************
#include "startState.h"

//************************************************************
//	前方宣言
//************************************************************
class CString2D;	// 文字列2Dクラス

//************************************************************
//	クラス定義
//************************************************************
// チュートリアル状態クラス
class CStartStateTutorial : public CStartState
{
public:
	// コンストラクタ
	CStartStateTutorial();

	// デストラクタ
	~CStartStateTutorial() override;

	// オーバーライド関数
	HRESULT Init(void) override;	// 初期化
	void Uninit(void) override;		// 終了
	void Update(const float fDeltaTime) override;	// 更新

private:
	// メンバ変数
	CString2D *m_pVersion;	// バージョン表記
};

#endif	// _START_STATE_TUTORIAL_H_
