//============================================================
//
//	何もしない状態ヘッダー [startStateNone.h]
//	Author：藤田勇一
//
//============================================================
//************************************************************
//	二重インクルード防止
//************************************************************
#ifndef _START_STATE_NONE_H_
#define _START_STATE_NONE_H_

//************************************************************
//	インクルードファイル
//************************************************************
#include "startState.h"

//************************************************************
//	クラス定義
//************************************************************
// 何もしない状態クラス
class CStartStateNone : public CStartState
{
public:
	// コンストラクタ
	CStartStateNone();

	// デストラクタ
	~CStartStateNone() override;

	// オーバーライド関数
	HRESULT Init(void) override;	// 初期化
	void Uninit(void) override;		// 終了
	void Update(const float fDeltaTime) override;	// 更新
};

#endif	// _START_STATE_NONE_H_
