//============================================================
//
//	ロゴ表示状態処理 [startStateLogo.cpp]
//	Author：藤田勇一
//
//============================================================
//************************************************************
//	インクルードファイル
//************************************************************
#include "startStateLogo.h"
#include "inputManager.h"
#include "startManager.h"
#include "logoManager.h"

//************************************************************
//	子クラス [CStartStateLogo] のメンバ関数
//************************************************************
//============================================================
//	コンストラクタ
//============================================================
CStartStateLogo::CStartStateLogo() :
	m_pLogoManager	(nullptr)	// ロゴマネージャー
{

}

//============================================================
//	デストラクタ
//============================================================
CStartStateLogo::~CStartStateLogo()
{

}

//============================================================
//	初期化処理
//============================================================
HRESULT CStartStateLogo::Init()
{
	// メンバ変数を初期化
	m_pLogoManager = nullptr;	// ロゴマネージャー

	// ロゴマネージャーの生成
	m_pLogoManager = CLogoManager::Create();
	if (m_pLogoManager == nullptr)
	{ // 生成に失敗した場合

		assert(false);
		return E_FAIL;
	}

	return S_OK;
}

//============================================================
//	終了処理
//============================================================
void CStartStateLogo::Uninit()
{
	// ロゴマネージャーの破棄
	SAFE_REF_RELEASE(m_pLogoManager);

	// 自身の破棄
	delete this;
}

//============================================================
//	更新処理
//============================================================
void CStartStateLogo::Update(const float fDeltaTime)
{
	// ロゴマネージャーの更新
	assert(m_pLogoManager != nullptr);
	m_pLogoManager->Update(fDeltaTime);

	if (input::Decide())
	{
		// チュートリアル状態にする
		m_pContext->ChangeState(new CStartStateTutorial);
	}
}
