//============================================================
//
//	初期設定状態ヘッダー [startStateOption.h]
//	Author：藤田勇一
//
//============================================================
//************************************************************
//	二重インクルード防止
//************************************************************
#ifndef _START_STATE_OPTION_H_
#define _START_STATE_OPTION_H_

//************************************************************
//	インクルードファイル
//************************************************************
#include "startState.h"

//************************************************************
//	クラス定義
//************************************************************
// 初期設定状態クラス
class CStartStateOption : public CStartState
{
public:
	// コンストラクタ
	CStartStateOption();

	// デストラクタ
	~CStartStateOption() override;

	// オーバーライド関数
	HRESULT Init(void) override;	// 初期化
	void Uninit(void) override;		// 終了
	void Update(const float fDeltaTime) override;	// 更新
};

#endif	// _START_STATE_OPTION_H_
