//============================================================
//
//	ロゴ状態ヘッダー [startStateLogo.h]
//	Author：藤田勇一
//
//============================================================
//************************************************************
//	二重インクルード防止
//************************************************************
#ifndef _START_STATE_LOGO_H_
#define _START_STATE_LOGO_H_

//************************************************************
//	インクルードファイル
//************************************************************
#include "startState.h"

//************************************************************
//	クラス定義
//************************************************************
// ロゴ状態クラス
class CStartStateLogo : public CStartState
{
public:
	// コンストラクタ
	CStartStateLogo();

	// デストラクタ
	~CStartStateLogo() override;

	// オーバーライド関数
	HRESULT Init(void) override;	// 初期化
	void Uninit(void) override;		// 終了
	void Update(const float fDeltaTime) override;	// 更新
};

#endif	// _START_STATE_LOGO_H_
