//============================================================
//
//	ロゴ表示状態ヘッダー [startStateLogo.h]
//	Author：藤田勇一
//
//============================================================
//************************************************************
//	二重インクルード防止
//************************************************************
#ifndef _START_STATE_LOGO_H_
#define _START_STATE_LOGO_H_

//************************************************************
//	インクルードファイル
//************************************************************
#include "startState.h"

//************************************************************
//	前方宣言
//************************************************************
class CLogoManager;	// ロゴマネージャークラス

//************************************************************
//	クラス定義
//************************************************************
// ロゴ表示状態クラス
class CStartStateLogo : public CStartState
{
public:
	// コンストラクタ
	CStartStateLogo();

	// デストラクタ
	~CStartStateLogo() override;

	// オーバーライド関数
	HRESULT Init() override;	// 初期化
	void Uninit() override;		// 終了
	void Update(const float fDeltaTime) override;	// 更新

private:
	// メンバ変数
	CLogoManager* m_pLogoManager;	// ロゴマネージャー
};

#endif	// _START_STATE_LOGO_H_
