//============================================================
//
//	設定状態ヘッダー [titleStateOption.h]
//	Author：藤田勇一
//
//============================================================
//************************************************************
//	二重インクルード防止
//************************************************************
#ifndef _TITLE_STATE_OPTION_H_
#define _TITLE_STATE_OPTION_H_

//************************************************************
//	インクルードファイル
//************************************************************
#include "titleState.h"

//************************************************************
//	前方宣言
//************************************************************
class COptionManager;	// 設定マネージャークラス

//************************************************************
//	クラス定義
//************************************************************
// 設定状態クラス
class CTitleStateOption : public CTitleState
{
public:
	// コンストラクタ
	CTitleStateOption();

	// デストラクタ
	~CTitleStateOption() override;

	// オーバーライド関数
	HRESULT Init() override;	// 初期化
	void Uninit() override;		// 終了
	void Update(const float fDeltaTime) override;	// 更新

private:
	// メンバ変数
	COptionManager* m_pOptionManager;	// 設定マネージャー
};

#endif	// _TITLE_STATE_OPTION_H_
