//============================================================
//
//	設定状態処理 [titleStateOption.cpp]
//	Author：藤田勇一
//
//============================================================
//************************************************************
//	インクルードファイル
//************************************************************
#include "titleStateOption.h"
#include "titleManager.h"
#include "optionManager.h"

//************************************************************
//	子クラス [CTitleStateOption] のメンバ関数
//************************************************************
//============================================================
//	コンストラクタ
//============================================================
CTitleStateOption::CTitleStateOption() :
	m_pOptionManager	(nullptr)	// 設定マネージャー
{

}

//============================================================
//	デストラクタ
//============================================================
CTitleStateOption::~CTitleStateOption()
{

}

//============================================================
//	初期化処理
//============================================================
HRESULT CTitleStateOption::Init()
{
	// メンバ変数を初期化
	m_pOptionManager = nullptr;	// 設定マネージャー

	// 設定マネージャーの生成
	m_pOptionManager = COptionManager::Create();
	if (m_pOptionManager == nullptr)
	{ // 生成に失敗した場合

		assert(false);
		return E_FAIL;
	}

	return S_OK;
}

//============================================================
//	終了処理
//============================================================
void CTitleStateOption::Uninit()
{
	// 設定マネージャーの破棄
	SAFE_REF_RELEASE(m_pOptionManager);

	// 自身の破棄
	delete this;
}

//============================================================
//	更新処理
//============================================================
void CTitleStateOption::Update(const float fDeltaTime)
{
	// 設定マネージャーの更新
	assert(m_pOptionManager != nullptr);
	if (m_pOptionManager->Update(fDeltaTime))
	{ // 状態遷移の操作が行われた場合

		// 遷移選択状態にする
		m_pContext->ChangeState(new CTitleStateSelect);
	}
}
