//============================================================
//
//	バージョン表記ヘッダー [version.h]
//	Author：藤田勇一
//
//============================================================
//************************************************************
//	二重インクルード防止
//************************************************************
#ifndef _VERSION_H_
#define _VERSION_H_

//************************************************************
//	インクルードファイル
//************************************************************
#include "string2D.h"

//************************************************************
//	クラス定義
//************************************************************
// バージョン表記クラス
class CVersion : public CString2D
{
public:
	// コンストラクタ
	CVersion();

	// デストラクタ
	~CVersion();

	// オーバーライド関数
	HRESULT Init() override;	// 初期化
	void Uninit() override;		// 終了
	void Update(const float fDeltaTime) override;	// 更新
	void Draw(CShader* pShader = nullptr) override;	// 描画

	// 静的メンバ関数
	static CVersion* Create();	// 生成
};

#endif	// _VERSION_H_
